https://en.m.wikibooks.org/wiki/SQL_Exercises/Employee_management

In [ ]:
%load_ext sql
%sql sqlite:///db.db3

In [ ]:
%%sql sqlite://
 
CREATE TABLE Departments (
   Code INTEGER PRIMARY KEY NOT NULL,
   Name NVARCHAR NOT NULL ,
   Budget REAL NOT NULL 
);
 
CREATE TABLE Employees (
   SSN INTEGER PRIMARY KEY NOT NULL,
   Name TEXT NOT NULL ,
   LastName VARCHAR NOT NULL ,
   Department INTEGER NOT NULL , 
   CONSTRAINT fk_Departments_Code FOREIGN KEY(Department) 
   REFERENCES Departments(Code)
);

INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','O''Donnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);

In [ ]:
# 1. Select the last name of all employees.
%sql select lastname from employees;

In [ ]:
# 2. Select the last name of all employees, without duplicates.
%sql select distinct lastname from employees;

In [ ]:
# 3. Select all the data of employees whose last name is "Smith".
%sql select * from employees where lastname = 'Smith';

In [ ]:
# 4. Select all the data of employees whose last name is "Smith" or "Doe".
%sql select * from employees where lastname = 'Smith' or lastname = 'Doe';

In [ ]:
%sql select * from employees where lastname in ('Smith','Doe');

In [ ]:
# 5. Select all the data of employees that work in department 14.
%sql select * from employees where department = 14;

In [ ]:
# 6. Select all the data of employees that work in department 37 or department 77.
%sql select * from employees where department = 37 or department = 77;

In [ ]:
%sql select * from employees where department in (37,77);

In [ ]:
# 7. Select all the data of employees whose last name begins with an "S".
%sql select * from employees where substr(lastname,1,1) = 'S';

In [ ]:
%sql select * from employees where lastname like 'S%';

In [ ]:
# 8. Select the sum of all the departments' budgets.
%sql select sum(budget) from departments;

In [ ]:
# 9. Select the number of employees in each department (you only need to show the department code and the number of employees).
%sql select department, count(*) from employees group by department;

In [ ]:
# 10. Select all the data of employees, including each employee's department's data.
%sql select * from employees, departments where employees.department = departments.code;

In [ ]:
%sql select * from employees inner join departments on employees.department = departments.code;

In [ ]:
# 11. Select the name and last name of each employee, along with the name and budget of the employee's department.
%sql select e.name, e.lastname, d.name, d.budget from employees as e inner join departments as d on e.department = d.code;

In [ ]:
# 12. Select the name and last name of employees working for departments with a budget greater than $60,000.
%sql select e.name, e.lastname from employees as e inner join departments as d on e.department = d.code where d.budget > 60000;

In [ ]:
%sql select e.name, e.lastname from employees as e inner join departments as d on e.department = d.code and d.budget > 60000;

In [ ]:
%sql select name, lastname from employees where department in (select code from departments where budget > 60000);

In [ ]:
# 13. Select the departments with a budget larger than the average budget of all the departments.
%sql select * from departments where budget > (select avg(budget) from departments);

In [ ]:
# 14. Select the names of departments with more than two employees.
%sql select name from departments where code in (select department from employees group by department having count(*) > 2);

In [ ]:
%sql select d.name from employees as e inner join departments as d on e.department = d.code group by d.code having count(*) > 2;

In [ ]:
%sql select d.name from departments as d where 2 < (select count(*) from employees where department = d.code);

In [ ]:
# 15. Select the name and last name of employees working for departments with second lowest budget.
%sql select name, lastname from employees where department = (select code from departments order by budget limit 1 offset 1);

In [ ]:
%sql select name, lastname from employees where department in (select code from departments where budget = (select top 1 budget from departments where budget in (select distinct top 2 budget from departments order by budget asc) order by budget desc));

In [ ]:
# 16. Add a new department called "Quality Assurance", with a budget of $40,000 and departmental code 11. Add an employee called "Mary Moore" in that department, with SSN 847-21-9811.
%sql insert into departments values (11, 'Quality Assurance', 40000);

In [ ]:
# 17. Reduce the budget of all departments by 10%.
%sql update departments set budget = budget * 0.9;

In [ ]:
# 18. Reassign all employees from the Research department (code 77) to the IT department (code 14).
%sql update employees set department = 14 where department = 77;

In [ ]:
# 19. Delete from the table all employees in the IT department (code 14).
%sql delete from employees where department = 14;

In [ ]:
# 20. Delete from the table all employees who work in departments with a budget greater than or equal to $60,000.
%sql delete from employees where department in (select code from departments where budget >= 60000);

In [ ]:
# 21. Delete from the table all employees.
%sql delete from employees;